In [1]:
import pandas as pd

In [2]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
print("Q1. List any five functions of the pandas library with execution.\n\nAns.read_csv(): This function is used to read data from a CSV file into a pandas DataFrame.\nhead(): This function is used to display the first few rows of a DataFrame.\ninfo(): This function is used to get a concise summary of a DataFrame including column data types and missing value\ndescribe(): This function is used to generate descriptive statistics of a DataFrame's numerical columns.\nfillna(): This function is used to fill missing values in a DataFrame with specified values.")

Q1. List any five functions of the pandas library with execution.

Ans.read_csv(): This function is used to read data from a CSV file into a pandas DataFrame.
head(): This function is used to display the first few rows of a DataFrame.
info(): This function is used to get a concise summary of a DataFrame including column data types and missing value
describe(): This function is used to generate descriptive statistics of a DataFrame's numerical columns.
fillna(): This function is used to fill missing values in a DataFrame with specified values.

In [5]:
df=pd.read_csv("AU.csv")

In [6]:
df

  Ruthik section  acedamic-year
0     AU     cse              1
1    BTH   AI&ML              4

In [7]:
df.head()

  Ruthik section  acedamic-year
0     AU     cse              1
1    BTH   AI&ML              4

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Ruthik         2 non-null      object
 1   section        2 non-null      object
 2   acedamic-year  2 non-null      int64
dtypes: int64(1), object(2)
memory usage: 176.0+ bytes

In [9]:
df.describe()

       acedamic-year
count        2.00000
mean         2.50000
std          2.12132
min          1.00000
25%          1.75000
50%          2.50000
75%          3.25000
max          4.00000

In [10]:
print("Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.\nAns.")

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.
Ans.

In [1]:
data= {"A":['a','a','a'],"B":['b','b','b'],"C":['c','c','c']}

In [21]:
df = pd.DataFrame(data,index=pd.RangeIndex(start=1, stop=2*len(data)+1, step=2))

In [22]:
df

   A  B  C
1  a  b  c
3  a  b  c
5  a  b  c

In [23]:
print("Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that \niterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.\nAns.")

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.
Ans.

In [65]:
df = pd.DataFrame({"Values":[10,20,30,40,50,60]})

In [66]:
df

   Values
0      10
1      20
2      30
3      40
4      50
5      60

In [63]:
def addv(df):
    sumv=0
    for index,row in df.iterrows():
        sumv = sumv + row["Values"]
        if index==2:
            break
    return sumv

In [67]:
print(addv(df))

60

In [68]:
print("Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.\nAns.")

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.
Ans.

In [5]:
df=pd.DataFrame({"Text":['a','bb','ccc']})

In [7]:
df['word_count']= df['Text'].apply(lambda x: len(x))

In [8]:
df

  Text  word_count
0    a           1
1   bb           2
2  ccc           3

In [90]:
print("Q5. How are DataFrame.size() and DataFrame.shape() different?\n\nAns.DataFrame.size returns the total number of elements (rows * columns) in the DataFrame. DataFrame.shape returns a tuple representing the dimensions of the DataFrame, where the first element is the number of rows and the second element is the number of columns.")

Q5. How are DataFrame.size() and DataFrame.shape() different?

Ans.DataFrame.size returns the total number of elements (rows * columns) in the DataFrame. DataFrame.shape returns a tuple representing the dimensions of the DataFrame, where the first element is the number of rows and the second element is the number of columns.

In [96]:
df.shape

(3, 2)

In [97]:
df.size

6

In [98]:
print("Q6. Which function of pandas do we use to read an excel file?\n\nAns.In pandas, the function used to read an Excel file is pd.read_excel()")

Q6. Which function of pandas do we use to read an excel file?

Ans.In pandas, the function used to read an Excel file is pd.read_excel()

In [99]:
print("Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address. \n\nThe username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.")

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [11]:
df =pd.DataFrame({"Email":['john.doe@example.com','ruthik@pw.com','Au@cse.com']})

In [12]:
df['user_name'] = df['Email'].apply(lambda word: word.split('@')[0] if '@' in word else '')

In [13]:
df

                  Email user_name
0  john.doe@example.com  john.doe
1         ruthik@pw.com    ruthik
2            Au@cse.com        Au

In [14]:
print("Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects\nall rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.\nAns.")

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.
Ans.

In [2]:
data ={"A":[3,8,6,2,9],"B":[5,2,9,3,1],"C":[1,7,4,5,2]}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [9]:
df1 = df[(df['A']>5) & (df['B']<10)]
df1

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [8]:
print("Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.\nANs.")

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.
ANs.

In [32]:
df = pd.DataFrame({"Column":[2,4,7,11,16]})
df

   Column
0       2
1       4
2       7
3      11
4      16

In [33]:
df.mean()

Column    8.0
dtype: float64

In [34]:
df.median()

Column    7.0
dtype: float64

In [35]:
df.std()

Column    5.612486
dtype: float64

In [36]:
print("Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.\nAns.")

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.
Ans.

In [20]:
df = pd.DataFrame({"date":['2024/1/7','2024-1-2','2024/1/1','2024-1-4','2024-1-5','2024-1-6','2024-1-3'],"sales":[1000,550,790,680,230,450,700]})

In [21]:
df

       date  sales
0  2024/1/7   1000
1  2024-1-2    550
2  2024/1/1    790
3  2024-1-4    680
4  2024-1-5    230
5  2024-1-6    450
6  2024-1-3    700

In [29]:
df['date'] = pd.to_datetime(df['date'])
df.sort_values('date')
df['moving_avg'] = df['sales'].rolling(window=7 , min_periods=1).mean()
df

        date  sales   moving_avg
0 2024-01-07   1000  1000.000000
1 2024-01-02    550   775.000000
2 2024-01-01    790   780.000000
3 2024-01-04    680   755.000000
4 2024-01-05    230   650.000000
5 2024-01-06    450   616.666667
6 2024-01-03    700   628.571429

In [31]:
print("Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column. For example, if df contains the following values:\nAns.")

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column. For example, if df contains the following values:
Ans.

In [32]:
df = pd.DataFrame({"date":['2024/1/7','2024-1-2','2024/1/1','2024-1-4','2024-1-5','2024-1-6','2024-1-3']})

In [36]:
def modify(df):
    df['date'] = pd.to_datetime(df['date'])
    df['week_day'] = df['date'].dt.day_name()
    return df

In [38]:
modify(df)

        date   week_day
0 2024-01-07     Sunday
1 2024-01-02    Tuesday
2 2024-01-01     Monday
3 2024-01-04   Thursday
4 2024-01-05     Friday
5 2024-01-06   Saturday
6 2024-01-03  Wednesday

In [39]:
print("Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.\nAns.")

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.
Ans.

In [3]:
df = pd.DataFrame({"date":['2023-01-01', '2023-01-15', '2023-01-31', '2023-02-01']})

In [5]:
df['date'] = pd.to_datetime(df['date'])

In [8]:
start = '2023-01-01'
end = '2023-01-31'
mask = df[(df['date']>=start)&(df['date']<=end)]

In [9]:
mask

        date
0 2023-01-01
1 2023-01-15
2 2023-01-31

In [ ]:
print("Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?\n\Ans.")